In [ ]:
#Q.1 H0- There is no any significant difference in diameter of cutlet in both the units- mu1=mu2
     H1- There is a significant difference in diameter of cutlet in both the units- mu1!=mu2

In [1]:
import pandas as pd
import numpy as np
from scipy import stats

In [2]:
df=pd.read_csv("E:\Susmita_Backup\Data Science Course\Data Science Assignment\Hypothesis Assignment-03\cutlets.csv")
df.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [3]:
df.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [7]:
UnitA=df['Unit A']
UnitB=df['Unit B']

In [8]:
#Two Sample T test
stats.ttest_ind(UnitA,UnitB)

Ttest_indResult(statistic=0.7228688704678061, pvalue=0.4722394724599501)

In [12]:
p=0.472

In [ ]:
#As we are checking with 5% significance level, here alpha=0.05

In [13]:
if p<=0.05:
    print("Null Hypothesis is rejected")
else:
    print("Null hypothesis is accepted")

Null hypothesis is accepted

In [ ]:
#Hence we accept that there is no significant difference between the diameter of cutlets in unit A & B, mu1=mu2

In [ ]:
#Q2.H0=There is no difference in average TAT of 4 labs=mu1=mu2=mu3=mu4
H1=There is a differnce in average TAT of 4 labs=mu1!=mu2!=mu3!=mu4

In [15]:
TAT=pd.read_csv("E:\Susmita_Backup\Data Science Course\Data Science Assignment\Hypothesis Assignment-03\LabTAT.csv")
TAT.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [20]:
TAT.mean()

Laboratory 1    178.361583
Laboratory 2    178.902917
Laboratory 3    199.913250
Laboratory 4    163.682750
dtype: float64

In [16]:
stats.f_oneway(TAT.iloc[:,0],TAT.iloc[:,1],TAT.iloc[:,2],TAT.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [19]:
stats.f_oneway(TAT['Laboratory 1'],TAT['Laboratory 2'],TAT['Laboratory 3'],TAT['Laboratory 4'])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [17]:
p=2.1156708949992414e-57

In [18]:
#As we are checking with 5% significance level, here alpha=0.05
if p<=0.05:
    print("Null Hypothesis is rejected")
else:
    print("Null hypothesis is accepted")

Null Hypothesis is rejected

In [ ]:
#Hence we accept that there is a significant difference in average TAT across 4 labs.

In [ ]:
#Q.3 H0=All proportions are equal,male:Female
     H1= Not all Proportions are equal

In [21]:
ratio=pd.read_csv("E:\Susmita_Backup\Data Science Course\Data Science Assignment\Hypothesis Assignment-03\BuyerRatio.csv")

In [22]:
ratio.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [31]:
ratio1=ratio.drop('Observed Values', axis=1)
ratio1

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [36]:
from scipy.stats import chi2_contingency

In [38]:
stat,pvalue,dof,expected = chi2_contingency(ratio1)

In [39]:
stat,pvalue,dof,expected

(1.595945538661058,
 0.6603094907091882,
 3,
 array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
        [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [40]:
#As we are checking with 5% significance level, here alpha=0.05
if pvalue<=0.05:
    print("Null Hypothesis is rejected")
else:
    print("Null hypothesis is accepted")

Null hypothesis is accepted

In [ ]:
#Hence test result is all proportions are equal.

In [ ]:
#Q.4 H0= The defective % not varies by centre
     H1= The defective % varies by centre

In [41]:
telecall=pd.read_csv("E:\Susmita_Backup\Data Science Course\Data Science Assignment\Hypothesis Assignment-03\Costomer+OrderForm.csv")

In [42]:
telecall.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [44]:
telecall.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    object
 1   Indonesia     300 non-null    object
 2   Malta         300 non-null    object
 3   India         300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [46]:
telecall.shape

(300, 4)

In [48]:
T1=telecall.replace(('Error Free','Defective'),(1,0))
T1

     Phillippines  Indonesia  Malta  India
0               1          1      0      1
1               1          1      1      0
2               1          0      0      1
3               1          1      1      1
4               1          1      0      1
..            ...        ...    ...    ...
295             1          1      1      1
296             1          1      1      1
297             1          1      0      1
298             1          1      1      1
299             1          0      0      1

[300 rows x 4 columns]

In [49]:
stat, pvalue, df, expected = chi2_contingency(T1)

In [50]:
stat, pvalue, df, expected

(112.74730231885849,
 1.0,
 897,
 array([[0.74793008, 0.73689052, 0.7424103 , 0.77276909],
        [0.74793008, 0.73689052, 0.7424103 , 0.77276909],
        [0.49862006, 0.49126035, 0.4949402 , 0.51517939],
        ...,
        [0.74793008, 0.73689052, 0.7424103 , 0.77276909],
        [0.99724011, 0.9825207 , 0.9898804 , 1.03035879],
        [0.49862006, 0.49126035, 0.4949402 , 0.51517939]]))

In [51]:
#As we are checking with 5% significance level, here alpha=0.05
if pvalue<=0.05:
    print("Null Hypothesis is rejected")
else:
    print("Null hypothesis is accepted")

Null hypothesis is accepted

In [ ]:
#Test result- The defective % of customer order forms not varies by centre.